{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_21", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder-input"}, "name": "decoder-input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "decoder-Embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 1769, "output_dim": 256, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "decoder-Embedding", "inbound_nodes": [[["decoder-input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_20"}, "name": "input_20", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "decoder-lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}, "name": "decoder-lstm", "inbound_nodes": [[["decoder-Embedding", 0, 0, {}], ["input_19", 0, 0, {}], ["input_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder-dense", "trainable": true, "dtype": "float32", "units": 1769, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder-dense", "inbound_nodes": [[["decoder-lstm", 0, 0, {}]]]}], "input_layers": [["decoder-input", 0, 0], ["input_19", 0, 0], ["input_20", 0, 0]], "output_layers": [["decoder-dense", 0, 0], ["decoder-lstm", 0, 1], ["decoder-lstm", 0, 2]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "decoder-Embedding/embeddings", "shape": [1769, 256], "dtype": "float32"}, {"name": "decoder-dense/kernel", "shape": [256, 1769], "dtype": "float32"}, {"name": "decoder-dense/bias", "shape": [1769], "dtype": "float32"}, {"name": "decoder-lstm/lstm_cell/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "decoder-lstm/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "decoder-lstm/lstm_cell/bias", "shape": [1024], "dtype": "float32"}]}]}